Rokasbarasa1/STM32-Quadcopter/src/main.c
                // Reset the yaw to the current degrees
                if(last_yaw != 50 && yaw == 50){
                    target_yaw = gyro_degrees[2];
                }

                last_yaw = yaw;

            }else if(strcmp(rx_type, "pid") == 0){
                // printf("\nGot pid");

                double added_proportional = 0;
                double added_integral = 0;
                double added_derivative = 0;
                double added_master_gain = 0;

                extract_pid_request_values(rx_data, strlen(rx_data), &added_proportional, &added_integral, &added_derivative, &added_master_gain);

                pitch_roll_gain_p = BASE_PITCH_ROLL_GAIN_P + added_proportional;
                pitch_roll_gain_i = BASE_PITCH_ROLL_GAIN_I + added_integral;
                pitch_roll_gain_d = BASE_PITCH_ROLL_GAIN_D + added_derivative;
                pitch_roll_master_gain = BASE_PITCH_ROLL_MASTER_GAIN + added_master_gain;

                added_pitch_roll_gain_p = added_proportional;
                added_pitch_roll_gain_i = added_integral;
                added_pitch_roll_gain_d = added_derivative;
                added_pitch_roll_master_gain = added_master_gain;

                // Configure the pitch pid 
                pid_set_proportional_gain(&pitch_pid, pitch_roll_gain_p * pitch_roll_master_gain);
                pid_set_integral_gain(&pitch_pid, pitch_roll_gain_i * pitch_roll_master_gain);
                pid_set_derivative_gain(&pitch_pid, pitch_roll_gain_d * pitch_roll_master_gain);
                pid_reset_integral_sum(&pitch_pid);

                // Configure the roll pid 
                pid_set_proportional_gain(&roll_pid, pitch_roll_gain_p * pitch_roll_master_gain);
                pid_set_integral_gain(&roll_pid, pitch_roll_gain_i * pitch_roll_master_gain);
                pid_set_derivative_gain(&roll_pid, pitch_roll_gain_d * pitch_roll_master_gain);
                pid_reset_integral_sum(&roll_pid);

            }else if(strcmp(rx_type, "remoteSyncBase") == 0){
                // printf("\nGot remoteSyncBase");
                send_pid_base_info_to_remote();
            }else if(strcmp(rx_type, "remoteSyncAdded") == 0){
                // printf("\nGot remoteSyncAdded");
                send_pid_added_info_to_remote();
            }

            rx_type[0] = '\0'; // Clear out the string by setting its first char to string terminator
        }

        // double error_altitude = mapValue(pid_get_error(&altitude_pid, altitude, HAL_GetTick()), -180.0, 180.0, -100.0, 100.0);
        // printf("Altitude error %6.2f ", error_altitude);
        
        if(((double)HAL_GetTick() - (double)last_signal_timestamp) / 1000.0 < minimum_signal_timing_seconds){
            pid_set_desired_value(&pitch_pid, target_pitch);
            pid_set_desired_value(&roll_pid, target_roll);
            pid_set_desired_value(&yaw_pid, target_yaw);
            pid_set_desired_value(&altitude_pid, target_altitude);

            // pitch is facing to the sides
            // roll is facing forwards and backwards
            error_pitch = pid_get_error(&pitch_pid, gyro_degrees[0], HAL_GetTick());
            error_roll = pid_get_error(&roll_pid, gyro_degrees[1], HAL_GetTick());
            // error_yaw = pid_get_error(&roll_pid, gyro_degrees[2], HAL_GetTick());
            // error_altitude = pid_get_error(&roll_pid, altitude, HAL_GetTick());

            motor_power[0] = error_altitude + (-error_pitch) +  (-error_roll);
            motor_power[1] = error_altitude + (-error_pitch) +  ( error_roll);
            motor_power[2] = error_altitude + ( error_pitch) +  ( error_roll);
            motor_power[3] = error_altitude + ( error_pitch) +  (-error_roll);

            // GPS side
            TIM2->CCR1 = setServoActivationPercent(motor_power[2], min_esc_pwm_value, max_esc_pwm_value-60);
            TIM2->CCR2 = setServoActivationPercent(motor_power[3], min_esc_pwm_value, max_esc_pwm_value-60);

            // No gps side
            TIM1->CCR1 = setServoActivationPercent(motor_power[0], min_esc_pwm_value, max_esc_pwm_value-60);
            TIM1->CCR4 = setServoActivationPercent(motor_power[1], min_esc_pwm_value, max_esc_pwm_value-60);
        }else{
            // GPS side
            TIM2->CCR1 = setServoActivationPercent(0, min_esc_pwm_value, max_esc_pwm_value);
            TIM2->CCR2 = setServoActivationPercent(0, min_esc_pwm_value, max_esc_pwm_value);

            // No gps side
            TIM1->CCR1 = setServoActivationPercent(0, min_esc_pwm_value, max_esc_pwm_value);
            TIM1->CCR4 = setServoActivationPercent(0, min_esc_pwm_value, max_esc_pwm_value);
        }

        // Print out for debugging
        // printf("ACCEL, %6.2f, %6.2f, %6.2f, ", acceleration_data[0], acceleration_data[1], acceleration_data[2]);
        // printf("GYRO, %6.2f, %6.2f, %6.2f, ", gyro_degrees[0], gyro_degrees[1], gyro_degrees[2]);
        // printf("GY %6.2f ", gyro_degrees[0]);

        // printf("MAG, %6.2f, %6.2f, %6.2f, ", magnetometer_data[0], magnetometer_data[1], magnetometer_data[2]);
        // printf("MOTOR 1=%6.2f 2=%6.2f 3=%6.2f 4=%6.2f, ", motor_power[0], motor_power[1], motor_power[2], motor_power[3]);
        // printf("TEMP %6.5f, ", temperature);
        // printf("ALT %6.2f, ", altitude);
        // printf("GPS %f, %f, ", gps_longitude, gps_latitude);
        // printf("ERROR pitch %6.2f, roll %6.2f, pitch %6.2f, yaw %6.2f, altitude %6.2f, ", error_pitch, error_roll, error_yaw, error_altitude);
        // printf("%6.5f %6.5f %6.5f", magnetometer_data[0], magnetometer_data[1], magnetometer_data[2]);  
        // printf("\n");

        fix_gyro_axis(gyro_degrees); // switch back the x and y axis of gyro to how they were before

        handle_loop_timing();
    }
}

void init_STM32_peripherals(){
    HAL_Init();
    SystemClock_Config();
    MX_GPIO_Init();
    HAL_GPIO_WritePin(GPIOC, GPIO_PIN_13, 0);

    HAL_Delay(1);
    MX_DMA_Init(); // This has to be before the uart inits, otherwise dma interrupts dont work
    MX_I2C1_Init();
    MX_SPI1_Init();
    MX_TIM1_Init();
    MX_TIM2_Init();
    HAL_Delay(1);
    MX_USART2_UART_Init();
    MX_USART1_UART_Init();
    RetargetInit(&huart1);

    HAL_TIM_PWM_Start(&htim1, TIM_CHANNEL_1);
    HAL_TIM_PWM_Start(&htim1, TIM_CHANNEL_4);
    HAL_TIM_PWM_Start(&htim2, TIM_CHANNEL_1);
    HAL_TIM_PWM_Start(&htim2, TIM_CHANNEL_2);

    HAL_GPIO_WritePin(GPIOB, GPIO_PIN_4, GPIO_PIN_SET);
    HAL_GPIO_WritePin(GPIOB, GPIO_PIN_5, GPIO_PIN_SET);

